TITLE object.asm
OPTION casemap:none

; third-party library
INCLUDE Irvine32.inc

; local library
INCLUDE object.inc


.data
; 小恐龍
; ****************************************************************************
; 尺寸
dino_xdim               =    40
dino_ydim               =    42
; ----------------------------------------------------------------------------
; 內容物屬性
dino_attribute_green    WORD dino_xdim DUP(lightGreen)
; ----------------------------------------------------------------------------
; 內容物字串
dino_contents           BYTE        "                      @@@@@@@@@@@@@@@@  "
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@  @@@@@@@@@@@@@@"
                        BYTE        "                    @@@@  @@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@@@@@@@@@@@"
                        BYTE        "                    @@@@@@@@@@          "
                        BYTE        "                    @@@@@@@@@@          "
                        BYTE        "                    @@@@@@@@@@@@@@@@    "
                        BYTE        "                    @@@@@@@@@@@@@@@@    "
                        BYTE        "@@                @@@@@@@@@@            "
                        BYTE        "@@                @@@@@@@@@@            "
                        BYTE        "@@             @@@@@@@@@@@@@            "
                        BYTE        "@@             @@@@@@@@@@@@@            "
                        BYTE        "@@@@        @@@@@@@@@@@@@@@@@@@@        "
                        BYTE        "@@@@        @@@@@@@@@@@@@@@@@@@@        "
                        BYTE        "@@@@@@    @@@@@@@@@@@@@@@@@@  @@        "
                        BYTE        "@@@@@@    @@@@@@@@@@@@@@@@@@  @@        "
                        BYTE        "@@@@@@@@@@@@@@@@@@@@@@@@@@@@            "
                        BYTE        "@@@@@@@@@@@@@@@@@@@@@@@@@@@@            "
                        BYTE        "@@@@@@@@@@@@@@@@@@@@@@@@@@@@            "
                        BYTE        "@@@@@@@@@@@@@@@@@@@@@@@@@@@@            "
                        BYTE        "  @@@@@@@@@@@@@@@@@@@@@@@@@@            "
                        BYTE        "  @@@@@@@@@@@@@@@@@@@@@@@@              "
                        BYTE        "    @@@@@@@@@@@@@@@@@@@@@@              "
                        BYTE        "    @@@@@@@@@@@@@@@@@@@@@@              "
                        BYTE        "      @@@@@@@@@@@@@@@@@@                "
                        BYTE        "      @@@@@@@@@@@@@@@@@@                "
                        BYTE        "        @@@@@@@@@@@@@@                  "
                        BYTE        "        @@@@@@@@@@@@@@                  "
                        BYTE        "          @@@@@@  @@@@                  "
                        BYTE        "          @@@@@@  @@@@                  "
                        BYTE        "          @@@@      @@                  "
                        BYTE        "          @@@@      @@                  "
                        BYTE        "          @@        @@                  "
                        BYTE        "          @@        @@                  "
                        BYTE        "          @@@@      @@@@                "
                        BYTE        "          @@@@      @@@@                "

; ----------------------------------------------------------------------------
; 角色: 綠色小恐龍
dino_green              CHARACTER   << OFFSET dino_contents,        \
                                       OFFSET dino_attribute_green, \
                                       < dino_xdim, dino_ydim >    >>
; ****************************************************************************


; 神奇小框
; *******************************************************************
; 尺寸
recto_xdim              =           24
recto_ydim              =           12
; -------------------------------------------------------------------
; 內容物字串
recto_contents          BYTE        recto_xdim * recto_ydim DUP("@")
; -------------------------------------------------------------------
; 內容物屬性
recto_attribute_blue    WORD        recto_xdim DUP(lightCyan)
recto_attribute_red     WORD        recto_xdim DUP(lightRed)
; -------------------------------------------------------------------
; 角色: 神奇小藍框
recto_blue              OBJECT      << OFFSET recto_contents,       \
                                       OFFSET recto_attribute_blue, \
                                       < recto_xdim, recto_ydim >  >>
; -------------------------------------------------------------------
; 角色: 神奇小紅框
recto_red               OBJECT      << OFFSET recto_contents,   \
                                    OFFSET recto_attribute_red, \
                                    < recto_xdim, recto_ydim > >>
; *******************************************************************



; 仙人掌
; *********************************************************************
; 尺寸
cactus_xdim             =           23
cactus_ydim             =           46
; *********************************************************************
; 內容物字串
cactus_contents         BYTE        "         @@@@@         "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@    @@@ "
                        BYTE        "        @@@@@@@   @@@@@"
                        BYTE        " @@@    @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@   @@@@@@@   @@@@@"
                        BYTE        "@@@@@@@@@@@@@@@@@@@@@@ "
                        BYTE        "@@@@@@@@@@@@@@@@@@@@@  "
                        BYTE        " @@@@@@@@@@@@@@@@@@@   "
                        BYTE        "  @@@@@@@@@@@@@@@@@    "
                        BYTE        "   @@@@@@@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@        "
                        BYTE        "        @@@@@@@   @    "
                        BYTE        "    @ @@@@@@@@@     @  "
; ---------------------------------------------------------------------
; 內容物屬性
cactus_attribute_green  WORD        cactus_xdim DUP(lightGreen)
; ---------------------------------------------------------------------
; 角色: 綠色仙人掌
cactus_green            OBJECT      << OFFSET cactus_contents,        \
                                       OFFSET cactus_attribute_green, \
                                       < cactus_xdim, cactus_ydim >  >>
; *********************************************************************


.code
; -------------------------------------------------
; Name:
;     BoxSetPos
; Brief:
;     將物體盒左下角置於某位置
; Uses:
;     eax esi
; Params:
;     box_ptr = 物體盒指標    (PTR BOX)
;     x       = 左下角 x 座標 (DWORD)
;     y       = 左下角 y 座標 (DWORD)
; Returns:
;     ...
; Example:
;     INVOKE BoxSetPos, ADDR dino_green.box, 20, 50
;     將綠色小恐龍左下角置於位置 (20, 50)
; -------------------------------------------------
BoxSetPos PROC box_ptr:PTR BOX, x:DWORD, y:DWORD
    mov esi, box_ptr
    mov eax, x
    mov (BOX PTR [esi]).pos.X, eax
    mov eax, y
    mov (BOX PTR [esi]).pos.Y, eax
    ret
BoxSetPos ENDP

END